<?php

namespace Database\Seeders;

use App\Models\LoadingZone;
use Illuminate\Database\Seeder;

class LoadingZoneSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            ['name' => 'БИКОМ', 'lng' => 55.588613, 'lat' => 37.663252],
            ['name' => 'ЧМПЗ ЕКАТЕРИНБУРГ', 'lng' => 56.721559, 'lat' => 60.567860],
            ['name' => 'РЦ СПБ ДЫБЕНКО', 'lng' => 59.876473, 'lat' => 30.482570],
            ['name' => 'ЧМПЗ  КРАСНОДАР', 'lng' => 45.010732, 'lat' => 39.096963],
            ['name' => 'ЧАСЦЫ', 'lng' => 55.619731, 'lat' => 36.855163],
            ['name' => 'БРЯНСК', 'lng' => 53.2164529, 'lat' => 34.4392199],
            ['name' => 'ПЕНЗА', 'lng' => 53.274574, 'lat' => 45.271640],
            ['name' => 'МСП-КОНСТАНТИНОВО', 'lng' => 55.497604, 'lat' => 37.990519],
            ['name' => 'МОССЕЛЬПРОМ-УЗЛОВСКАЯ', 'lng' => 54.044877, 'lat' => 38.122387],
            ['name' => 'ЛИСКО-БРОЙЛЕР', 'lng' => 50.979849, 'lat' => 39.531609],
            ['name' => 'ТАМБОВСКАЯ ИНДЕЙКА', 'lng' => 53.265963, 'lat' => 40.209773],
            ['name' => 'АЛТАЙСКИЙ БРОЙЛЕР', 'lng' => 52.499502, 'lat' => 85.118351],
            ['name' => 'МСП Белгород', 'lng' => 50.590050, 'lat' => 36.632017],
            ['name' => 'МСП Курск', 'lng' => 51.522802, 'lat' => 37.968437],
            ['name' => 'ЧМПЗ МОСКВА(ПЕРМСКАЯ)', 'lng' => 55.821335, 'lat' => 37.733841],
            ['name' => 'ЧМПЗ ПЕНЗА', 'lng' => 53.265445, 'lat' => 45.016782],
            ['name' => 'ЧМПЗ УЛЬЯНОВСК', 'lng' => 54.292996, 'lat' => 48.268776],
            ['name' => 'ЧМПЗ ДАНКОВ', 'lng' => 53.258417, 'lat' => 39.157171],
            ['name' => 'ПКО ОТЕЧПРОДУКТ', 'lng' => 54.446749, 'lat' => 21.036236],
            ['name' => 'ЧМПЗ КАШИРА', 'lng' => 54.7144536, 'lat' => 38.4813858],
            ['name' => 'Компас Фудс', 'lng' => 53.113498, 'lat' => 38.135945],
            ['name' => 'Пит-Продукт', 'lng' => 59.772304, 'lat' => 30.185487],
            ['name' => 'Пит-Продукт', 'lng' => 59.915542700289, 'lat' => 31.032994115275],
            ['name' => 'Краснобор', 'lng' => 54.166026, 'lat' => 37.446937],
            ['name' => 'ЛИПЕЦК-РЫБА', 'lng' => 52.639155, 'lat' => 39.636725],
            ['name' => 'ХЛАДОКОМБИНАТ (Воронеж)', 'lng' => 51.643186, 'lat' => 39.277363],
            ['name' => 'ЭНЕРГИЯ', 'lng' => 56.097265, 'lat' => 37.154379],
            ['name' => 'СК ЕВРАЗИЯ', 'lng' => 55.514930, 'lat' => 36.971561],
        ];

        LoadingZone::insert($data);
    }
}
